{
    "version": "https://jsonfeed.org/version/1",
    "title": "Tobby Hagler",
    "description": "",
    "home_page_url": "https://tobbyhagler.com",
    "feed_url": "https://tobbyhagler.com/feed.json",
    "user_comment": "",
    "icon": "https://tobbyhagler.com/media/website/tobbyhagler-logo-white.png",
    "author": {
        "name": "Tobby Hagler"
    },
    "items": [
        {
            "id": "https://tobbyhagler.com/posts/latest-sourdough-loaf/",
            "url": "https://tobbyhagler.com/posts/latest-sourdough-loaf/",
            "title": "Latest Sourdough Loaf",
            "summary": "I just took this loaf out of the oven. I've almost got&hellip;",
            "content_html": "<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-translation=\"Add images\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://tobbyhagler.com/media/posts/15/gallery/IMG_5866.jpeg\" data-size=\"2644x3522\"><img loading=\"lazy\" src=\"https://tobbyhagler.com/media/posts/15/gallery/IMG_5866-thumbnail.jpeg\" alt=\"Close-up view of a sourdough loaf's ear\" width=\"768\" height=\"1023\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://tobbyhagler.com/media/posts/15/gallery/IMG_5871.jpeg\" data-size=\"3176x2382\"><img loading=\"lazy\" src=\"https://tobbyhagler.com/media/posts/15/gallery/IMG_5871-thumbnail.jpeg\" alt=\"Slide view of a sourdough small lamé marks\" width=\"768\" height=\"576\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://tobbyhagler.com/media/posts/15/gallery/IMG_5872.jpeg\" data-size=\"2638x2638\"><img loading=\"lazy\" src=\"https://tobbyhagler.com/media/posts/15/gallery/IMG_5872-thumbnail.jpeg\" alt=\"Top view of a sourdough loaf's ear and lamé cuts\" width=\"768\" height=\"768\"></a></figure>\n</div></div>\n<p>I just took this loaf out of the oven. I've almost got the timing down, but not quite there, yet. I think it needed 2-3 more minutes on the second half, after taking the lid off the Dutch oven.</p>\n<p>I'm starting to get a handle on the lamé leaves; the ear is decent, but I never seem to get the angle just right. I think next time, I'll soak the lamé knife in ice water before scoring it.</p>",
            "image": "https://tobbyhagler.com/media/posts/15/IMG_5866-2.jpeg",
            "author": {
                "name": "Tobby Hagler"
            },
            "tags": [
                   "Sourdough"
            ],
            "date_published": "2025-12-20T16:26:26-05:00",
            "date_modified": "2025-12-20T16:33:09-05:00"
        },
        {
            "id": "https://tobbyhagler.com/posts/the-grove-of-tau-ceti-releases-tonight/",
            "url": "https://tobbyhagler.com/posts/the-grove-of-tau-ceti-releases-tonight/",
            "title": "The Grove of Tau Ceti releases tonight",
            "summary": "<p>I’m thrilled to share that <em data-start=\"356\" data-end=\"379\">The Grove of Tau Ceti</em> has officially launched!</p>\n",
            "content_html": "<p>I’m thrilled to share that <em data-start=\"356\" data-end=\"379\">The Grove of Tau Ceti</em> has officially launched!</p>\n\n<p>This marks the end of a long and surreal journey — from drafting the first chapter beside a quiet Carolina pond to holding the finished book in my hands.</p>\n<p>The novel is now available in <a href=\"https://www.amazon.com/Grove-Tau-Ceti-Tobby-Hagler/dp/B0FWJ4KWFG/\">paperback</a> and <a href=\"https://www.amazon.com/Grove-Tau-Ceti-Tobby-Hagler/dp/B0FX6Y2X77/\">Kindle</a> on Amazon, with additional distributors coming soon. Other ebook formats will follow in <strong data-start=\"726\" data-end=\"742\">late January</strong>.</p>\n<p>You can learn more at the official website: <a href=\"https://thegroveoftauceti.com/\">thegroveoftauceti.com</a></p>\n<figure class=\"post__image\"><a href=\"https://thegroveoftauceti.com/\"><img loading=\"lazy\"  src=\"https://tobbyhagler.com/media/posts/13/front-cover-large.jpeg\" alt=\"\" width=\"828\" height=\"1280\" sizes=\"(min-width: 760px) 660px, calc(93.18vw - 30px)\" srcset=\"https://tobbyhagler.com/media/posts/13/responsive/front-cover-large-xs.jpeg 320w ,https://tobbyhagler.com/media/posts/13/responsive/front-cover-large-sm.jpeg 480w ,https://tobbyhagler.com/media/posts/13/responsive/front-cover-large-md.jpeg 768w ,https://tobbyhagler.com/media/posts/13/responsive/front-cover-large-xl.jpeg 1024w\"></figure></a></p>\n<p> </p>",
            "author": {
                "name": "Tobby Hagler"
            },
            "tags": [
                   "Writing"
            ],
            "date_published": "2025-10-22T22:13:02-04:00",
            "date_modified": "2025-10-22T22:13:31-04:00"
        },
        {
            "id": "https://tobbyhagler.com/posts/kozy-krampus-drops-today/",
            "url": "https://tobbyhagler.com/posts/kozy-krampus-drops-today/",
            "title": "Kozy Krampus Drops Today!",
            "summary": "I'm excited to announce that my first published fiction dropped today! I'm&hellip;",
            "content_html": "<div class=\"wtfDPiMltYwXrDPGMMqXQLGuSdedKjcRGXE\" tabindex=\"-1\">\n<div class=\"feed-shared-inline-show-more-text\n        feed-shared-update-v2__description feed-shared-inline-show-more-text--minimal-padding\n        \n        feed-shared-inline-show-more-text--3-lines\n        feed-shared-inline-show-more-text--expanded\n        \n        \n        \" tabindex=\"-1\" data-artdeco-is-focused=\"true\">\n<div class=\"update-components-text relative update-components-update-v2__commentary \" dir=\"ltr\"><span class=\"break-words\n          tvm-parent-container\"> <span dir=\"ltr\">I'm excited to announce that my first published fiction dropped today! I'm lucky enough to share the pages with 28 amazingly talented writers in Kozy Krampus, an anthology of cozy cosmic holiday horror short stories.<br><br>Check it out: <a href=\"https://www.underlandpress.com/kozy-krampus/\">https://www.underlandpress.com/kozy-krampus/</a> </span></span></div>\n<div class=\"update-components-text relative update-components-update-v2__commentary \" dir=\"ltr\"><span class=\"break-words\n          tvm-parent-container\"><span dir=\"ltr\">Order: <a href=\"https://firebirdcreative.myshopify.com/products/kozy-krampus\" title=\"\">print</a> or <a href=\"https://weightlessbooks.com/kozy-krampus/\" title=\"\">ebook</a><br><br>I'm also thrilled to say that this is just the first of several fiction publications in the coming months, so stay tuned!</span> </span></div>\n</div>\n</div>",
            "author": {
                "name": "Tobby Hagler"
            },
            "tags": [
                   "Writing"
            ],
            "date_published": "2025-09-23T09:37:00-04:00",
            "date_modified": "2025-10-16T21:43:10-04:00"
        },
        {
            "id": "https://tobbyhagler.com/posts/sourdough-starter-experiment/",
            "url": "https://tobbyhagler.com/posts/sourdough-starter-experiment/",
            "title": "Sourdough Starter Experiment",
            "summary": "<p>I've finally found some great formulas with sourdough starters that work for me.</p>\n",
            "content_html": "<p>I've finally found some great formulas with sourdough starters that work for me.</p>\n\n<p>I've experimented with sourdough starters before, but they ultimately fail because of neglect or impatience. One of my latest sets was no exception. I had two nearly-viable starters after several weeks of feeding (the first was over a month) with still no luck. I tried feeding variations—different ratios, hydration levels, and flour mixes—but only ever saw a slight rise from them. Eventually, I inadvertently killed them by leaving them in the oven with the light on for too long, and they spoiled.</p>\n<p>Based on what I've learned about sourdough chemistry (the yeast, the LAB, how feeding and hydration ratios make a difference, here's what finally worked for me. I'm currently growing two amazing starters after only two days.</p>\n<h2>Tips for the noobs</h2>\n<p>Sourdough requires a kitchen scale. Ratios are based on weight, not volume, so ditch anything that uses the ambiguous \"ounce\" as a measurement. Convert to grams—this <em>is</em> science, after all, which requires the metric system.</p>\n<p>Ratios are expressed as starter-to-flour-to-water, or X:Y:Z. A good practice is to place a clean jar on your scale and tare it to zero. Pour 20 grams of your spent starter into the jar and discard the rest (pro-tip: search for \"sourdough discard pancake recipe\"). Early days of a starter call for a 1:1:1 ratio: 20 grams of spent starter, 20 grams of water, and 20 grams of flour. Stir well, cover loosely, and let it sit.</p>\n<p>Measure the weight of your empty jars beforehand. You'll thank me later.</p>\n<p>Another tip is to use an old hair band or a rubber band to mark the level. This way you can see how high it rises over time. Dry erase markers also work well.</p>\n<h2>Starter #1: Zymia</h2>\n<p>Yeast water + rye and wheat flour.</p>\n<p>A week prior, I started some yeast water (originally intended to feed one of the previous starters that was struggling). This consists of a handful of raisins in a jar of filtered water from the fridge and a tablespoon of honey. Stir, shake, and let sit for a week. When it's slightly fizzy when shaken, and before the raisin skins flake off, it's ready. It'll have a slightly sweet, hard cider-like smell to it, and a light, golden-brown color that's not cloudy.</p>\n<p>My starter consisted of 30 grams of whole wheat flour and 30 grams of yeast water; a 1:1 starter ratio.</p>\n<p>A day later, it rose a little before falling. When I fed it, I didn't discard anything. Instead, I tared the still-full jar and removed it, giving me the weight of the starter once I added the jar's empty weight. In my case, it was around 60 grams of starter. I fed it at a ratio of 1:1:1—60 grams of the spent starter, 60 grams of wheat flour, and 60 grams of yeast water.</p>\n<p>The next day, it had nearly doubled in height, with lots of hardy bubbles and a decent dome. That's impressive in only two days.</p>\n<p>And it smells so sweet. The familiar sourdough tang is there, along with a cider aroma that's so unique to the yeast water.</p>\n<h2>Starter #2: Rhyza</h2>\n<p>This one was more traditional. It was a simple 1:1 ratio of 20 grams of rye flour and 10 grams of wheat flour, and 30 grams of filtered water. The first feeding was a 1:1:1 ratio of all 60 grams of the spent starter, 40 grams of rye flour mixed with 20 grams of wheat flour, and 60 grams of filtered water.</p>\n<p>At the same time as Zymia's nearly doubled rise, Rhyza had almost tripled in height! I was almost afraid it would expand out of the jar. Thankfully, it reached its peak just before reaching the lid.</p>\n<h2>Next steps</h2>\n<p>I'll update this blog over time with the progress of these experiments. So far, they're off to great starts.</p>\n<p>I will discard and feed them again in the morning, using 1:1:1 of their respective makeup, and re-evaluate in the evening. I will discard all but 20 grams of the starter, so my flour and water will also be 20 grams each.</p>\n<p>With the discard of tomorrow evening's feeding (whichever seems the most active), I will make bread. I'll start by feeding the discard with a 1:0.5:0.5 ratio and using the resulting levain to start the bread dough. I estimate that the bread dough will take 8-10 hours, so I'll let it rise overnight. </p>\n<p>If it's successful, I'll post the recipe.</p>\n<p>Wish me luck!</p>",
            "author": {
                "name": "Tobby Hagler"
            },
            "tags": [
                   "Sourdough"
            ],
            "date_published": "2025-07-22T00:42:04-04:00",
            "date_modified": "2025-07-29T19:22:28-04:00"
        },
        {
            "id": "https://tobbyhagler.com/posts/the-grove-is-delayed-again/",
            "url": "https://tobbyhagler.com/posts/the-grove-is-delayed-again/",
            "title": "The Grove is Delayed Again",
            "summary": "<p>...But that's actually a good thing.</p>\n",
            "content_html": "<p>...But that's actually a good thing.</p>\n\n<p>I've been a writer for years, and <em>The Grove of Tau Ceti</em> is my first (finished) novel. I'm really happy with it, too. It took a long time to get here, but I'm now one click away from being a published sci-fi author. I even have physical copies with fantastic cover art by <a href=\"https://nikwilets.com/\">Nik Wilets</a>.</p>\n<p>With the help of JB Kish and his <a href=\"https://www.writingmilestones.com/\">Writing Milestones</a> coaching, I could see the path from writer to author. Publication day was <em>initially</em> May 23. With a deadline set—and nothing motivates me more than beating a deadline—we crafted the complete plan I needed to write <em>and publish</em> a novel.</p>\n<p>For every milestone reached, I loved the story and its characters even more (except Hector). So when the manuscript came back from my editor, I sent query letters to a few literary agents. You know... because why not?</p>\n<p>My stack of rejection letters grew fast. And that's okay. Rejection letters mean you're putting in the work. Right?</p>\n<p>Then I got a few of the kind that say, \"I love the premise, but it's not what I'm looking for right now.\" That's still a no, but at least it's an encouraging no. So I kept at it.</p>\n<p>And then one day... \"Would you mind sending along the next NN pages/chapters?\" </p>\n<p>As May 23 approached, my manuscript was still under consideration. I pushed the self-publish date to July 25 to leave the door open for traditional publishing possibilities, while keeping a publish-by date on the counter to keep me accountable.</p>\n<p>After months of silence, I assumed it wasn't in the stars. It's cool, though. The plan was always to self-publish. Finding a few interested agents who ultimately send rejections still exceeded my expectations when I began working with JB.</p>\n<p>And that leads up to why I'm delaying it again. Agents are hellabusy, and sometimes they just can't get back to you for a long time. And I recently got a \"still currently considering the project\" update, which... [insert Carlton Dance meme]!</p>\n<p>I want the best possible publication for <em>The Grove of Tau Ceti</em>, which is why I've decided to postpone the launch again.</p>\n<p>My apologies to friends and family who frequently ask, \"Is your book out yet?\" and I've replied with dates that have come and gone. For now, that answer is simply: \"Soon!\"</p>",
            "author": {
                "name": "Tobby Hagler"
            },
            "tags": [
                   "Writing"
            ],
            "date_published": "2025-07-18T21:47:58-04:00",
            "date_modified": "2025-07-19T22:12:12-04:00"
        },
        {
            "id": "https://tobbyhagler.com/posts/announcing-kozy-krampus/",
            "url": "https://tobbyhagler.com/posts/announcing-kozy-krampus/",
            "title": "Announcing Kozy Krampus",
            "summary": "<p>I'm more excited than a demon with a sack full of kids!</p>\n",
            "content_html": "<p>I'm more excited than a demon with a sack full of kids!</p>\n\n<p>My first published short story will appear in <strong><em data-start=\"255\" data-end=\"269\">Kozy Krampus</em></strong>, an anthology of 29 delightfully twisted tales featuring the horned holiday menace himself. The collection drops late September, just in time to curl up with a mug of something warm and a healthy fear of hooves on the rooftop.</p>\n<p>So drop what you're doing and go <a href=\"https://firebirdcreative.myshopify.com/products/kozy-krampus\" title=\"Pre-order Kozy Krampus\" target=\"_blank\" rel=\"noopener noreferrer\">pre-order</a> now! Or don’t. That’s up to you. But remember: Krampus thinks disobedient children taste the best.</p>\n<hr>\n<p>Mark Teppo and Frances Lu-Pai Ippolito, eds., <em data-start=\"381\" data-end=\"395\">Kozy Krampus</em> (Portland, OR: Underland Press, 2025).</p>",
            "author": {
                "name": "Tobby Hagler"
            },
            "tags": [
                   "Writing"
            ],
            "date_published": "2025-07-17T10:53:18-04:00",
            "date_modified": "2025-07-18T21:49:32-04:00"
        }
    ]
}
