{
    "version": "https://jsonfeed.org/version/1",
    "title": "Tobby Hagler",
    "description": "",
    "home_page_url": "https://tobbyhagler.com",
    "feed_url": "https://tobbyhagler.com/feed.json",
    "user_comment": "",
    "icon": "https://tobbyhagler.com/media/website/tobbyhagler-logo-white.png",
    "author": {
        "name": "Tobby Hagler"
    },
    "items": [
        {
            "id": "https://tobbyhagler.com/posts/the-grove-is-delayed-again/",
            "url": "https://tobbyhagler.com/posts/the-grove-is-delayed-again/",
            "title": "The Grove is Delayed Again",
            "summary": "<p>...But that's actually a good thing.</p>\n",
            "content_html": "<p>...But that's actually a good thing.</p>\n\n<p>I've been a writer for years, and <em>The Grove of Tau Ceti</em> is my first (finished) novel. I'm really happy with it, too. It took a long time to get here, but I'm now one click away from being a published sci-fi author. I even have physical copies with fantastic cover art by <a href=\"https://nikwilets.com/\">Nik Wilets</a>.</p>\n<p>With the help of JB Kish and his <a href=\"https://www.writingmilestones.com/\">Writing Milestones</a> project, I could see the path from writer to author. Publication day was <em>initially</em> May 23. With a deadline set—and nothing motivates me more than beating a deadline—we crafted the complete plan I needed to write <em>and publish</em> a novel.</p>\n<p>For every milestone reached, I loved the story and its characters even more (except Hector). So when the manuscript came back from my editor, I sent query letters to a few literary agents. You know... because why not?</p>\n<p>My stack of rejection letters grew fast. And that's okay. Rejection letters mean you're putting in the work. Right?</p>\n<p>Then I got a few of the kind that say, \"I love the premise, but it's not what I'm looking for right now.\" That's still a no, but at least it's an encouraging no. So I kept at it.</p>\n<p>And then one day... \"Would you mind sending along the next NN pages/chapters?\" </p>\n<p>As May 23 approached, my manuscript was still under consideration. I pushed the self-publish date to July 25 to leave the door open for traditional publishing possibilities, while keeping a publish-by date on the counter to keep me accountable.</p>\n<p>After months of silence, I assumed it wasn't in the stars. It's cool, though. The plan was always to self-publish. Finding a few interested agents who ultimately send rejections still exceeded my expectations when I began working with JB.</p>\n<p>And that leads up to why I'm delaying it again. Agents are hellabusy, and sometimes they just can't get back to you for a long time. And I recently got a \"still currently considering the project\" update, which... [insert Carlton Dance meme]!</p>\n<p>I want the best possible publication for <em>The Grove of Tau Ceti</em>, which is why I've decided to postpone the launch again.</p>\n<p>My apologies to friends and family who frequently ask, \"Is your book out yet?\" and I've replied with dates that have come and gone. For now, that answer is simply: \"Soon!\"</p>",
            "author": {
                "name": "Tobby Hagler"
            },
            "tags": [
                   "Writing"
            ],
            "date_published": "2025-07-18T21:47:58-04:00",
            "date_modified": "2025-07-18T21:49:11-04:00"
        },
        {
            "id": "https://tobbyhagler.com/posts/announcing-kozy-krampus/",
            "url": "https://tobbyhagler.com/posts/announcing-kozy-krampus/",
            "title": "Announcing Kozy Krampus",
            "summary": "<p>I'm more excited than a demon with a sack full of kids!</p>\n",
            "content_html": "<p>I'm more excited than a demon with a sack full of kids!</p>\n\n<p>My first published short story will appear in <strong><em data-start=\"255\" data-end=\"269\">Kozy Krampus</em></strong>, an anthology of 29 delightfully twisted tales featuring the horned holiday menace himself. The collection drops late September, just in time to curl up with a mug of something warm and a healthy fear of hooves on the rooftop.</p>\n<p>So drop what you're doing and go <a href=\"https://firebirdcreative.myshopify.com/products/kozy-krampus\" title=\"Pre-order Kozy Krampus\" target=\"_blank\" rel=\"noopener noreferrer\">pre-order</a> now! Or don’t. That’s up to you. But remember: Krampus thinks disobedient children taste the best.</p>\n<hr>\n<p>Mark Teppo and Frances Lu-Pai Ippolito, eds., <em data-start=\"381\" data-end=\"395\">Kozy Krampus</em> (Portland, OR: Underland Press, 2025).</p>",
            "author": {
                "name": "Tobby Hagler"
            },
            "tags": [
                   "Writing"
            ],
            "date_published": "2025-07-17T10:53:18-04:00",
            "date_modified": "2025-07-18T21:49:32-04:00"
        }
    ]
}
